[
    {
        "type": "snackbar",
        "body": "Study Tools heeft nu 15,000+ gebruikers! Dankjewel.",
        "buttons": [
            {
                "innerText": "Bericht lezen",
                "expandToDialog": "Beste lezer, \n\nIk heb nooit durven dromen dat Study Tools ooit zo veel gebruikers zou krijgen, maar het is toch \ngebeurd: vorige week hebben we de 11,000 gebruikers aangetikt. Nogmaals ben ik enorm \nblij dat ik Magister fijner heb kunnen maken voor mensen zoals jij en ik. \n\nIk heb net mijn laatste examens afgerond en dit was dus mijn laatste schooljaar op de middelbare. Ik ben \naan het kijken of ik iets kan regelen met Magister om dit project voort te zetten. Ik houd je op de hoogte. \n\nWél zeker is dat je zeer binnenkort kunt genieten van een gloednieuwe, handgemaakte Magister Wrapped. \nDaarin zie je allerlei statistiekjes over je schooljaar. Als je examenleerling bent, zie je zelfs statistieken \nvan je hele schoolperiode. Je ziet Wrapped vanzelf verschijnen, zo lang je je extensie up-to-date houdt \nen je je browser af en toe opnieuw start! \n\nAls je zin hebt in wat gezelligheid, join dan mijn Discord-server (linkje in het configuratiepaneel!). Natuurlijk \nhoud ik je op de hoogte van belangrijk nieuws door middel van meldingen zoals deze.\n\nBedankt,\nQuinten 💚"
            }
        ],
        "dateStart": "2024-06-01 08:00",
        "dateEnd": "2024-06-17 17:00",
        "duration": 10000,
        "showOnceId": "11kthanks"
    },
    {
        "type": "snackbar",
        "body": "De cijferlijst gaat binnenkort sluiten. Maak snel een cijferback-up:",
        "buttons": [
            {
                "innerText": "Back-uppen",
                "href": "#/cijfers/cijferoverzicht"
            }
        ],
        "dateStart": "2024-06-17 08:00",
        "dateEnd": "2024-06-20 17:00",
        "duration": 10000,
        "onlyForSchools": ["amadeuslyceum", "amadeus"]
    },
    {
        "type": "snackbar",
        "body": "Vergeet je niet in te schrijven voor je keuzeblokken!",
        "buttons": [
            {
                "innerText": "Zermelo",
                "href": "https://amadeuslyceum.zportal.nl/app/"
            }
        ],
        "onlyOnWeekdays": [1],
        "onlyBeforeTime": "11:00",
        "onlyAfterTime": "08:00",
        "onlyForSchools": ["amadeuslyceum", "amadeus"],
        "duration": 10000
    }
]
